Repository: hopeengineer/waddek-lk
Catalog: lib/l10n/app_*.arb
Languages: si, ta

# appTitle
source: Waddek.lk
si: වද්දෙක්.lk
ta: வத்தெக்.lk

# appTagline
source: Find skilled workers near you
si: ඔබට ආසන්නයේ දක්ෂ කම්කරුවන් සොයන්න
ta: உங்களுக்கு அருகிலுள்ள திறமையான தொழிலாளர்களைக் கண்டறியுங்கள்

# welcome
source: Welcome to Waddek
si: වද්දෙක් වෙත සාදරයෙන් පිළිගනිමු
ta: வத்தெக் க்கு வரவேற்கிறோம்

# enterPhone
source: Enter your phone number to get started
si: ආරම්භ කිරීමට ඔබේ දුරකථන අංකය ඇතුළත් කරන්න
ta: தொடங்க உங்கள் தொலைபேசி எண்ணை உள்ளிடுங்கள்

# sendCode
source: Send Verification Code
si: සත්‍යාපන කේතය යවන්න
ta: சரிபார்ப்புக் குறியீட்டை அனுப்புங்கள்

# verifyNumber
source: Verify your number
si: ඔබේ අංකය සත්‍යාපනය කරන්න
ta: உங்கள் எண்ணைச் சரிபார்க்கவும்

# codeSentTo
source: Code sent to {phone}
si: කේතය {phone} වෙත යවන ලදී
ta: குறியீடு {phone} க்கு அனுப்பப்பட்டது

source: Verify
si: සත්‍යාපනය
ta: சரிபார்

source: Resend code
si: කේතය නැවත යවන්න
ta: குறியீட்டை மீண்டும் அனுப்பு

# resendIn
source: Resend in {seconds}s
si: තත්පර {seconds}කින් නැවත යවන්න
ta: {seconds} வினாடிகளில் மீண்டும் அனுப்பு

# invalidPhone
source: Enter a valid Sri Lankan phone number
si: වලංගු ශ්‍රී ලාංකික දුරකථන අංකයක් ඇතුළත් කරන්න
ta: செல்லுபடியாகும் இலங்கை தொலைபேசி எண்ணை உள்ளிடுங்கள்

# phoneRequired
source: Phone number is required
si: දුරකථන අංකය අවශ්‍යයි
ta: தொலைபேசி எண் தேவை

# enterVerificationCode
source: Enter the verification code
si: සත්‍යාපන කේතය ඇතුළත් කරන්න
ta: சரிபார்ப்புக் குறியீட்டை உள்ளிடுங்கள்

source: Code must be 6 digits
si: කේතය ඉලක්කම් 6ක් විය යුතුයි
ta: குறியீடு 6 இலக்கங்களாக இருக்க வேண்டும்

# otpSendFailed
source: Failed to send OTP. Please try again.
si: OTP යැවීමට අසමත් විය. නැවත උත්සාහ කරන්න.
ta: OTP அனுப்புவதில் தோல்வி. மீண்டும் முயற்சிக்கவும்.

# verificationFailed
source: Verification failed. Please try again.
si: සත්‍යාපනය අසාර්ථකයි. නැවත උත්සාහ කරන්න.
ta: சரிபார்ப்பு தோல்வியுற்றது. மீண்டும் முயற்சிக்கவும்.

source: I want to…
si: මට අවශ්‍යයි…
ta: நான் விரும்புகிறேன்…

# chooseRole
source: Choose how you'll use Waddek
si: ඔබ වද්දෙක් භාවිතා කරන ආකාරය තෝරන්න
ta: வத்தெக்கை எவ்வாறு பயன்படுத்துவீர்கள் என்பதைத் தேர்ந்தெடுக்கவும்

# findWorkers
source: Find skilled workers
si: දක්ෂ කම්කරුවන් සොයන්න
ta: திறமையான தொழிலாளர்களைக் கண்டறியுங்கள்

# findWorkersDesc
source: Post jobs, get quotes, hire nearby workers
si: රැකියා පළකරන්න, මිල ගණන් ලබාගන්න, ළඟම කම්කරුවන් බඳවාගන්න
ta: வேலைகளை இடுகையிடுங்கள், மதிப்பீடுகளைப் பெறுங்கள், அருகிலுள்ள தொழிலாளர்களை நியமியுங்கள்

# offerServices
source: Offer my services
si: මගේ සේවා ලබා දෙන්න
ta: என் சேவைகளை வழங்குங்கள்

# offerServicesDesc
source: Get job leads, place bids, earn money
si: රැකියා ලබාගන්න, ලංසු තබන්න, මුදල් උපයන්න
ta: வேலை வாய்ப்புகளைப் பெறுங்கள், ஏலம் விடுங்கள், பணம் சம்பாதியுங்கள்

# continueBtn
source: Continue
si: ඉදිරියට
ta: தொடரவும்

source: Select Language
si: භාෂාව තෝරන්න
ta: மொழியைத் தேர்ந்தெடுக்கவும்

source: Language changed
si: භාෂාව වෙනස් කරන ලදී
ta: மொழி மாற்றப்பட்டது

source: Home
si: මුල් පිටුව
ta: முகப்பு

source: Jobs
si: රැකියා
ta: வேலைகள்

source: Wallet
si: මුදල් පසුම්බිය
ta: பணப்பை

source: Chat
si: චැට්
ta: அரட்டை

source: Profile
si: පැතිකඩ
ta: சுயவிவரம்

# postJob
source: Post a Job
si: රැකියාවක් පළ කරන්න
ta: வேலையை இடுகையிடு

source: My Jobs
si: මගේ රැකියා
ta: எனது வேலைகள்

source: Available Jobs
si: පවතින රැකියා
ta: கிடைக்கும் வேலைகள்

source: Job Details
si: රැකියා විස්තර
ta: வேலை விவரங்கள்

source: Place Bid
si: ලංසුවක් තබන්න
ta: ஏலம் விடு

source: Accept Bid
si: ලංසුව පිළිගන්න
ta: ஏலத்தை ஏற்கவும்

source: Unlock Details
si: විස්තර අගුළු හරින්න
ta: விவரங்களைத் திற

# unlockFree
source: Unlock — Free (Pro Pass)
si: අගුළු හරින්න — නොමිලේ (Pro Pass)
ta: திற — இலவசம் (Pro Pass)

# unlockForAmount
source: Unlock — Rs. {amount}
si: අගුළු හරින්න — රු. {amount}
ta: திற — ரூ. {amount}

source: Insufficient balance
si: ප්‍රමාණවත් ශේෂයක් නැත
ta: போதுமான இருப்பு இல்லை

source: Top Up Now
si: දැන් ටොප් අප් කරන්න
ta: இப்போது டாப் அப் செய்யுங்கள்

# upgradeProPass
source: Upgrade to Pro Pass
si: Pro Pass වෙත උසස් කරන්න
ta: Pro Pass க்கு மேம்படுத்துங்கள்

source: Wallet Balance
si: මුදල් පසුම්බි ශේෂය
ta: பணப்பை இருப்பு

source: Top Up
si: ටොප් අප්
ta: டாப் அப்

source: Transaction History
si: ගනුදෙනු ඉතිහාසය
ta: பரிவர்த்தனை வரலாறு

# proPass
source: Waddek Pro Pass
si: වද්දෙක් Pro Pass
ta: வத்தெக் Pro Pass

# proPassDesc
source: Zero lead fees, priority ranking, verified badge
si: නොමිලේ ලීඩ්, ප්‍රමුඛතා ශ්‍රේණිගත කිරීම, සත්‍යාපිත ලාංඡනය
ta: இலவச லீட் கட்டணங்கள், முன்னுரிமை தரவரிசை, சரிபார்க்கப்பட்ட பேட்ஜ்

# proPassPrice
source: Rs. 1,500/month
si: රු. 1,500/මාසිකව
ta: ரூ. 1,500/மாதம்

source: Subscribe
si: දායක වන්න
ta: சந்தா செலுத்துங்கள்

source: Cancel Subscription
si: දායකත්වය අවලංගු කරන්න
ta: சந்தாவை ரத்து செய்யுங்கள்

source: Reviews
si: සමාලෝචන
ta: மதிப்புரைகள்

source: Submit Review
si: සමාලෝචනය ඉදිරිපත් කරන්න
ta: மதிப்புரையை சமர்ப்பிக்கவும்

# rateExperience
source: Rate your experience
si: ඔබේ අත්දැකීම ශ්‍රේණිගත කරන්න
ta: உங்கள் அனுபவத்தை மதிப்பிடுங்கள்

source: Notifications
si: දැනුම්දීම්
ta: அறிவிப்புகள்

source: Settings
si: සැකසීම්
ta: அமைப்புகள்

source: Sign Out
si: පිටවන්න
ta: வெளியேறு

source: Total Credits
si: මුළු ණය
ta: மொத்த கிரெடிட்கள்

source: Bonus
si: ප්‍රසාද
ta: போனஸ்

source: Lead Fee
si: ලීඩ් ගාස්තුව
ta: லீட் கட்டணம்

source: Refund
si: ආපසු ගෙවීම
ta: பணத்தைத் திருப்பி அளி

source: Customer
si: පාරිභෝගිකයා
ta: வாடிக்கையாளர்

source: Worker
si: කම්කරුවා
ta: தொழிலாளர்

# markComplete
source: Mark as Complete
si: සම්පූර්ණ කළ බවට සලකුණු කරන්න
ta: நிறைவு செய்யப்பட்டதாகக் குறிக்கவும்

source: Report Issue
si: ගැටලුවක් වාර්තා කරන්න
ta: சிக்கலைப் புகாரளிக்கவும்

source: Cancel
si: අවලංගු
ta: ரத்து

source: Confirm
si: තහවුරු කරන්න
ta: உறுதிப்படுத்து

source: Save
si: සුරකින්න
ta: சேமி

source: Done
si: අවසන්
ta: முடிந்தது

source: Error
si: දෝෂය
ta: பிழை

source: Success
si: සාර්ථකයි
ta: வெற்றி

source: Loading...
si: පූරණය වෙමින්...
ta: ஏற்றுகிறது...

# noResults
source: No results found
si: ප්‍රතිඵල හමු නොවීය
ta: முடிவுகள் எதுவும் கிடைக்கவில்லை

source: Retry
si: නැවත උත්සාහ කරන්න
ta: மீண்டும் முயற்சிக்கவும்

# cashPaymentNote
source: Payment is made in cash directly to the worker
si: ගෙවීම සෘජුවම කම්කරුවාට මුදලින් කරනු ලැබේ
ta: பணம் நேரடியாக தொழிலாளருக்கு ரொக்கமாக வழங்கப்படும்

# tierWaddek
source: Waddek
si: වද්දෙක්
ta: வத்தெக்

# tierProfessional
source: Professional
si: වෘත්තීය
ta: தொழில்முறை

# tierSupiri
source: Supiri
si: සුපිරි
ta: சூப்பிரி
